const products = [
    {
      id: "1",
      name: "ساعة ذكية",
      price: 1350,
      discount: 1199.99,
      image: "https://moutech-eg.vercel.app/images/1.jpg",
      description: `  
        - تصميم أنيق وعصري يناسب كل الأذواق.  
        - مقاومة للماء والغبار لضمان الاستخدام في كل الظروف.    
        - تتبع نبضات القلب والنشاط البدني بدقة عالية.   
        - عمر بطارية طويل يدوم لعدة أيام.   
        - تنبيهات ذكية للمكالمات والرسائل.   
        - دعم كامل للغة العربية! 🇸🇦   
        - شاشة لمس عالية الدقة مع واجهات قابلة للتخصيص.   
        - ميزات تتبع النوم لتحسين صحتك اليومية.   
        - مزامنة فورية مع هاتفك الذكي. 📱   
        - والكثير من الميزات الأخرى لتسهيل حياتك!   
    
        📞 للطلب والاستفسار: 01091602558   
        🌐 زوروا موقعنا: makkah-tech.vercel.app   
    
        ✨ لا تفوّت الفرصة! احصل على ساعتك الآن واستمتع بكل هذه المزايا وأكثر! 💥   
    
        🎁 العرض محدود، اطلب الآن قبل نفاد الكمية!   
        🔖 #ساعة_ذكية #تقنية #جديد #مكة_تك #مزايا_رائعة #أناقة_وفعالية 
      `,
    },
    {
      id: "2",
      name: "سماعة بلوتوث",
      price: 750,
      discount: 499.99,
      image: "https://moutech-eg.vercel.app/images/1.jpg",
      description: `  
        - تصميم مريح وخفيف للراحة أثناء الاستخدام الطويل.  
        - تقنية بلوتوث 5.0 لتوصيل أسرع وأقوى.   
        - جودة صوت ممتازة مع ميزة إلغاء الضوضاء.  
        - عمر بطارية طويل يصل إلى 20 ساعة من التشغيل المتواصل.  
        - قابلية التحكم في الصوت والمكالمات بسهولة.  
        - تصميم عصري يناسب كافة الأذواق.  
        - مزامنة فورية مع كافة الأجهزة الذكية.  
        - متوفرة بالعديد من الألوان الجذابة!  
        - وميزات أخرى تسهل تجربتك الصوتية!  
  
        📞 للطلب والاستفسار: 01091602558  
        🌐 زوروا موقعنا: makkah-tech.vercel.app  
  
        ✨ احصل على سماعتك الآن واستمتع بصوت لا مثيل له! 💥  
  
        🎁 العرض محدود، لا تفوّت الفرصة!  
        🔖 #سماعة_بلوتوث #تقنية #جودة_صوت #مكة_تك #صوت_نقي #راحة_واستخدام 
      `,
    },
    {
      id: "3",
      name: "مكبر صوت محمول",
      price: 600,
      discount: 449.99,
      image: "https://moutech-eg.vercel.app/images/1.jpg",
      description: `  
        - مكبر صوت صغير الحجم مع صوت قوي وواضح.  
        - تقنية بلوتوث لسهولة الاتصال بالأجهزة.   
        - مقاوم للماء مما يجعله مثالياً للاستخدام في الهواء الطلق.  
        - بطارية تدوم حتى 12 ساعة من الاستخدام المتواصل.  
        - تصميم عصري وأنيق يناسب أي مكان.  
        - يمكنك من الاتصال بسهولة مع مكبرات صوت أخرى لتجربة صوتية أفضل.  
        - يعمل على جميع الأجهزة المحمولة مثل الهواتف الذكية والأجهزة اللوحية.  
        - يتمتع بإمكانية حمله في أي مكان.  
  
        📞 للطلب والاستفسار: 01091602558  
        🌐 زوروا موقعنا: makkah-tech.vercel.app  
  
        ✨ لا تفوّت الفرصة، احصل على مكبر الصوت الآن واستمتع بصوت عالي الجودة! 💥  
  
        🎁 العرض محدود، لا تتردد في طلبك!  
        🔖 #مكبر_صوت #بلوتوث #تقنية #مقاوم_للماء #مكة_تك #صوت_جودة 
      `,
    },
  ];
  